[
    {
        "character": "Jesse Pinkman",
        "aliases": [],
        "fragment": "Jesse Pinkman is the central character of the TV show 'Breaking Bad' and the film 'El Camino'. He is a former methamphetamine cook and dealer who is trying to escape his troubled past."
    },
    {
        "character": "Walter White",
        "aliases": [
            "Heisenberg"
        ],
        "fragment": "Walter White is the main antagonist of 'Breaking Bad' and appears in a flashback scene in 'El Camino'. He is a high school chemistry teacher turned methamphetamine manufacturer."
    },
    {
        "character": "Todd Alquist",
        "aliases": [],
        "fragment": "Todd Alquist is a sociopathic character who appears in both 'Breaking Bad' and 'El Camino'. He is a former methamphetamine cook and becomes a major antagonist for Jesse Pinkman."
    },
    {
        "character": "Neil Kandy",
        "aliases": [],
        "fragment": "Neil Kandy is a new character introduced in 'El Camino'. He is described as 'Nazi-adjacent' and is a sociopath who creates conflict for Jesse Pinkman."
    },
    {
        "character": "Ed Galbraith",
        "aliases": [],
        "fragment": "Ed Galbraith is a vacuum repairman who helps people disappear and is a recurring character in both 'Breaking Bad' and 'Better Call Saul'. He plays a significant role in 'El Camino'."
    },
    {
        "character": "Huell Babineaux",
        "aliases": [],
        "fragment": "Huell Babineaux is a character from 'Breaking Bad' and 'Better Call Saul'. He appears in a promotional campaign for 'El Camino' but does not appear in the film."
    },
    {
        "character": "Jane Margolis",
        "aliases": [],
        "fragment": "Jane Margolis is a character from 'Breaking Bad' who appears in a flashback scene in 'El Camino'. She has a significant impact on Jesse Pinkman's life."
    },
    {
        "character": "Skyler White",
        "aliases": [],
        "fragment": "Skyler White is Walter White's wife and a major character in 'Breaking Bad'. She is mentioned as a potential character for 'El Camino' but does not appear in the film."
    },
    {
        "character": "Walter Jr.",
        "aliases": [],
        "fragment": "Walter Jr. is Walter White's son and a recurring character in 'Breaking Bad'. He is mentioned as a potential character for 'El Camino' but does not appear in the film."
    },
    {
        "character": "Hank Schrader",
        "aliases": [],
        "fragment": "Hank Schrader is a DEA agent and Walter White's brother-in-law in 'Breaking Bad'. He is mentioned as a potential character for 'El Camino' but does not appear in the film."
    },
    {
        "character": "Marie Schrader",
        "aliases": [],
        "fragment": "Marie Schrader is Hank Schrader's wife and a recurring character in 'Breaking Bad'. She is mentioned as a potential character for 'El Camino' but does not appear in the film."
    },
    {
        "character": "Saul Goodman",
        "aliases": [],
        "fragment": "Saul Goodman is a criminal lawyer and a major character in both 'Breaking Bad' and 'Better Call Saul'. He is mentioned as a potential character for 'El Camino' but does not appear in the film."
    }
]