[
    {
        "character": "Jesse Pinkman",
        "aliases": [],
        "fragment": "Jesse Pinkman asks Mike Ehrmantraut where he would go to start over."
    },
    {
        "character": "Walter White",
        "aliases": [
            "Heisenberg"
        ],
        "fragment": "Walter White partners with Jesse Pinkman to build a crystal meth empire."
    },
    {
        "character": "Todd Alquist",
        "aliases": [],
        "fragment": "Todd Alquist takes Jesse Pinkman to his apartment to dispose of a cleaning lady's body."
    },
    {
        "character": "Jane Margolis",
        "aliases": [],
        "fragment": "Jane Margolis dismisses Jesse Pinkman's metaphorical talk about going wherever the universe takes him."
    },
    {
        "character": "Skinny Pete",
        "aliases": [],
        "fragment": "Skinny Pete and Badger hide Jesse Pinkman's car and give him a place to sleep."
    },
    {
        "character": "Badger Mayhew",
        "aliases": [],
        "fragment": "Badger Mayhew drives south in a Thunderbird to make it appear Jesse Pinkman is headed to Mexico."
    },
    {
        "character": "Ed Galbraith",
        "aliases": [
            "The Disappearer"
        ],
        "fragment": "Ed Galbraith refuses to help Jesse Pinkman unless he pays the full amount for his services."
    },
    {
        "character": "Mike Ehrmantraut",
        "aliases": [],
        "fragment": "Mike Ehrmantraut cautions Jesse Pinkman that starting over would make amends impossible."
    },
    {
        "character": "Neil Kandy",
        "aliases": [],
        "fragment": "Neil Kandy challenges Jesse Pinkman to a duel for his share of the cash."
    },
    {
        "character": "Casey",
        "aliases": [],
        "fragment": "Casey distracts Lou Schanzer while Jesse Pinkman hides in Todd Alquist's apartment."
    },
    {
        "character": "Lou Schanzer",
        "aliases": [],
        "fragment": "Lou Schanzer reports finding an old note from Todd Alquist."
    },
    {
        "character": "Kenny",
        "aliases": [],
        "fragment": "Kenny is one of Jesse Pinkman's captors and a member of the neonazi gang."
    },
    {
        "character": "Old Joe",
        "aliases": [],
        "fragment": "Old Joe helps Jesse Pinkman and Walter White with activities connected to their meth business."
    },
    {
        "character": "Diane Pinkman",
        "aliases": [],
        "fragment": "Diane Pinkman has a strained relationship with her son, Jesse Pinkman."
    },
    {
        "character": "Adam Pinkman",
        "aliases": [],
        "fragment": "Adam Pinkman has a strained relationship with his son, Jesse Pinkman."
    }
]