[
    {
        "character": "Arturo Colon",
        "aliases": [],
        "fragment": "Arturo is sent to intimidate Mike into recanting his testimony against Tuco but is overpowered by Mike."
    },
    {
        "character": "Gaff",
        "aliases": [],
        "fragment": "Gaff serves as the cartel's representative in a sitdown with Gus and rejects Gus's offer."
    },
    {
        "character": "Gonzo",
        "aliases": [],
        "fragment": "Gonzo dies while moving No-Doze's body from under a stack of cars in a junkyard."
    },
    {
        "character": "No-Doze",
        "aliases": [],
        "fragment": "No-Doze is beaten to death by Tuco for insulting his intelligence and authority."
    },
    {
        "character": "Tortuga",
        "aliases": [],
        "fragment": "Tortuga is beheaded by Tucos cousins and his head is attached to a tortoise as part of a bomb."
    },
    {
        "character": "Ximenez Lecerda",
        "aliases": [],
        "fragment": "Ximenez smuggles cocaine from Mexico and carries cash back to the cartel."
    },
    {
        "character": "Declan",
        "aliases": [],
        "fragment": "Declan is a meth dealer who operates in Phoenix, Arizona and refuses to work with Walter and Jesse."
    },
    {
        "character": "Emilio Koyama",
        "aliases": [],
        "fragment": "Emilio is Jesse's former partner in the meth business and is killed by phosphine gas in the RV."
    },
    {
        "character": "Krazy-8",
        "aliases": [],
        "fragment": "Krazy-8 becomes suspicious of Jesse and forces him to take him to Jesse's new partner."
    },
    {
        "character": "Tortuga",
        "aliases": [],
        "fragment": "Tortuga is beheaded by Tucos cousins and his head is attached to a tortoise as part of a bomb."
    },
    {
        "character": "Wendy",
        "aliases": [],
        "fragment": "Wendy is a meth-addicted street prostitute who associates with Jesse Pinkman."
    },
    {
        "character": "Huell Babineaux",
        "aliases": [],
        "fragment": "Huell is Saul Goodman's bodyguard and executes various intimidation tactics."
    },
    {
        "character": "Ed Galbraith",
        "aliases": [
            "The Disappearer"
        ],
        "fragment": "Ed specializes in providing fugitives with new identities and new places to live."
    },
    {
        "character": "Francesca Liddy",
        "aliases": [],
        "fragment": "Francesca is Saul Goodman's outspoken receptionist and secretary."
    },
    {
        "character": "Patrick Kuby",
        "aliases": [],
        "fragment": "Kuby assists in facilitating the car wash sale and intimidates Ted Beneke."
    },
    {
        "character": "Joey Dixon",
        "aliases": [
            "Camera Guy"
        ],
        "fragment": "Joey is the cameraman of the college filmmaking crew that Jimmy occasionally uses."
    },
    {
        "character": "Phil",
        "aliases": [
            "Sound Guy"
        ],
        "fragment": "Phil handles the microphones and audio for the college filmmaking crew."
    },
    {
        "character": "Cheri",
        "aliases": [
            "Drama Girl",
            "Makeup Girl"
        ],
        "fragment": "Cheri assists Joey's film crew and arranges hair and makeup for individuals appearing on camera."
    }
]